numbers = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

# TODO заменить значение пропущенного элемента средним арифметическим
# Первый шаг - определение суммы всех числовых элементов, исключаяя неизвестный
# Для этого вводим переменную для суммы
full_sum = 0
# Проверяем все элементы списка используя условие
for x in numbers:
    if x is not None:
        full_sum += x
# Определяем количество всех элементов, включая неизвестный
count = len(numbers)
# Определяем среднее арифметическое всех значений в списке
z = full_sum / count
# Заменяем None на среднее арифметическое
for i in range(count):
    if numbers[i] is None:
        numbers[i] = z
        break
print("Измененный список:", numbers)
